Revit 2027 API
Grid Class
 Represents a single grid line within Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.DatumPlane
 Autodesk.Revit.DB.Grid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Grid : DatumPlane
Public Class Grid
	Inherits DatumPlane
public ref class Grid : public DatumPlane
type Grid =
    class
        inherit DatumPlane
    end
The Grid type exposes the following members.
Properties
Name | Description
AssemblyInstanceId |  The id of the assembly instance to which the element belongs.
(Inherited from Element)
BoundingBox | Retrieves a box that circumscribes all geometry of the element.
(Inherited from Element)
Category | Retrieves a Category object that represents the category or sub category in which the element resides.
(Inherited from Element)
CreatedPhaseId |  Id of a Phase at which the Element was created.
(Inherited from Element)
Curve | Retrieves an object that represents the geometry of the grid line.
DemolishedPhaseId |  Id of a Phase at which the Element was demolished.
(Inherited from Element)
DesignOption | Returns the design option to which the element belongs.
(Inherited from Element)
Document | Returns the Document in which the Element resides.
(Inherited from Element)
Geometry | Retrieves the geometric representation of the element.
(Inherited from Element)
GroupId |  The id of the group to which an element belongs.
(Inherited from Element)
Id |  A unique identifier for an Element in an Autodesk Revit project.
(Inherited from Element)
IsCurved |  Identifies if the grid line is curved or straight.
IsModifiable |  Identifies if the element is modifiable.
(Inherited from Element)
IsTransient |  Indicates whether an element is transient or permanent.
(Inherited from Element)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Element)
LevelId |  The id of the level associated with the element.
(Inherited from Element)
Location | This property is used to find the physical location of an element within a project.
(Inherited from Element)
Name | A human readable name for the Element.
(Inherited from Element)
OwnerViewId |  The id of the view that owns the element.
(Inherited from Element)
Parameter[BuiltInParameter] | Retrieves a parameter from the element given a parameter id.
(Inherited from Element)
Parameter[Definition] | Retrieves a parameter from the element based on its definition.
(Inherited from Element)
Parameter[Guid] | Retrieves a parameter from the element given a GUID for a shared parameter.
(Inherited from Element)
Parameters | Retrieves a set containing all of the parameters that are contained within the element.
(Inherited from Element)
ParametersMap | Retrieves a map containing all of the parameters that are contained within the element.
(Inherited from Element)
Pinned |  Identifies if the element has been pinned to prevent changes.
(Inherited from Element)
UniqueId |  A stable unique identifier for an element within the document.
(Inherited from Element)
VersionGuid |  Get the element version Guid.
(Inherited from Element)
ViewSpecific |  Identifies if the element is owned by a view.
(Inherited from Element)
WorksetId |  Get Id of the Workset which owns the element.
(Inherited from Element)
Top
Methods
Name | Description
AddLeader |  Adds a default Leader for the indicated end of the datum plane. This method does not apply to Reference planes (which do not support leaders).
(Inherited from DatumPlane)
ArePhasesModifiable |  Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
(Inherited from Element)
CanBeHidden | Indicates if the element can be hidden in the view.
(Inherited from Element)
CanBeLocked |  Identifies if the element can be locked.
(Inherited from Element)
CanBeVisibleInView |  Checks if the datum plane can be visible in the view.
(Inherited from DatumPlane)
CanDeleteSubelement |  Checks if given subelement can be removed from the element.
(Inherited from Element)
CanHaveTypeAssigned() |  Identifies if the element can have a type assigned.
(Inherited from Element)
ChangeTypeId(ElementId) |  Changes the type of the element.
(Inherited from Element)
Create(Document, Arc) |  Creates a new radial grid line.
Create(Document, Line) |  Creates a new grid line.
DeleteEntity |  Deletes the existing entity created by %schema% in the element
(Inherited from Element)
DeleteSubelement |  Removes a subelement from the element.
(Inherited from Element)
DeleteSubelements |  Removes the subelements from the element.
(Inherited from Element)
Dispose
(Inherited from Element)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
EvaluateAllParameterValues |  Evaluates all the parameters' values of the element.
(Inherited from Element)
EvaluateParameterValues |  Evaluate the parameters' values of the element on the given parameter ID set.
(Inherited from Element)
GetCurvesInView |  Gets a collection of curves representing the DatumPlane element in the given view.
(Inherited from DatumPlane)
GetDatumExtentTypeInView |  Identifies whether the curve representing the datum plane is displayed according to its actual 3d extents, or else according to a view specific setting.
(Inherited from DatumPlane)
GetDependentElements |  Get all elements that, from a logical point of view, are the children of this Element.
(Inherited from Element)
GetEntity |  Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
(Inherited from Element)
GetEntitySchemaGuids |  Returns the Schema guids of any Entities stored in this element.
(Inherited from Element)
GetExtents |  Gets the extents of the grid in the model.
GetExternalFileReference |  Gets information pertaining to the external file referenced by the element.
(Inherited from Element)
GetExternalResourceReference |  Gets the ExternalResourceReference associated with a specified external resource type.
(Inherited from Element)
GetExternalResourceReferenceExpanded |  Gets the collection of ExternalResourceReference associated with a specified external resource type.
(Inherited from Element)
GetExternalResourceReferences |  Gets the map of the external resource references referenced by the element.
(Inherited from Element)
GetExternalResourceReferencesExpanded |  Gets the expanded map of the external resource references referenced by the element.
(Inherited from Element)
GetGeneratingElementIds |  Returns the ids of the element(s) that generated the input geometry object.
(Inherited from Element)
GetGeometryObjectFromReference |  Retrieve one geometric primitive contained in the element given a reference.
(Inherited from Element)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetLeader |  Gets a copy of the leader applied to the indicated end of the datum plane. This method does not apply to Reference planes (which do not support leaders).
(Inherited from DatumPlane)
GetMaterialArea |  Gets the area of the material with the given id.
(Inherited from Element)
GetMaterialIds |  Gets the element ids of all materials present in the element.
(Inherited from Element)
GetMaterialVolume |  Gets the volume of the material with the given id.
(Inherited from Element)
GetMonitoredLinkElementIds |  Provides the link instance IDs when the element is monitoring.
(Inherited from Element)
GetMonitoredLocalElementIds |  Provides the local element IDs when the element is monitoring.
(Inherited from Element)
GetOrderedParameters |  Gets the parameters associated to the element in order.
(Inherited from Element)
GetParameter | Retrieves a parameter from the element given identifier.
(Inherited from Element)
GetParameterFormatOptions |  Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
(Inherited from Element)
GetParameters | Retrieves the parameters from the element via the given name.
(Inherited from Element)
GetPhaseStatus |  Gets the status of a given element in the input phase
(Inherited from Element)
GetPropagationViews |  Gets a list of candidate views which are parallel to the current view and to which the extents of the datum may be propagated.
(Inherited from DatumPlane)
GetSubelements |  Returns the collection of element subelements.
(Inherited from Element)
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetTypeId |  Returns the identifier of this element's type.
(Inherited from Element)
GetValidTypes() |  Obtains a set of types that are valid for this element.
(Inherited from Element)
HasBubbleInView |  Identifies if the DatumPlane has bubble or not.
(Inherited from DatumPlane)
HasPhases |  Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
(Inherited from Element)
HideBubbleInView |  Hides the bubble in a view. This method does not apply to Reference planes.
(Inherited from DatumPlane)
IsBubbleVisibleInView |  Identifies if the bubble is visible or not in a view.
(Inherited from DatumPlane)
IsCreatedPhaseOrderValid |  Returns true if createdPhaseId and demolishedPhaseId are in order.
(Inherited from Element)
IsCurveValidInView |  Checks if the curve is valid to be as the extents for the datum plane in a view. The curve must be bound and coincident with the original one of the datum plane.
(Inherited from DatumPlane)
IsDemolishedPhaseOrderValid |  Returns true if createdPhaseId and demolishedPhaseId are in order.
(Inherited from Element)
IsExternalFileReference |  Determines whether this Element represents an external file.
(Inherited from Element)
IsHidden | Identifies if the element has been permanently hidden in the view.
(Inherited from Element)
IsLeaderValid |  Identifies if the leader valid or not for this DatumPlane. This method does not apply to Reference planes (which do not support leaders).
(Inherited from DatumPlane)
IsMonitoringLinkElement |  Indicate whether an element is monitoring any elements in any linked models.
(Inherited from Element)
IsMonitoringLocalElement |  Indicate whether an element is monitoring other local elements.
(Inherited from Element)
IsPhaseCreatedValid |  Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
(Inherited from Element)
IsPhaseDemolishedValid |  Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
(Inherited from Element)
IsValidType(ElementId) |  Checks if given type is valid for this element.
(Inherited from Element)
LookupParameter | Attempts to find a parameter on the element which has the given name.
(Inherited from Element)
Maximize3DExtents |  Computes the 3d extents of all model geometry and levels, and extends the 3d extents of this datum surface to include the model extents.
(Inherited from DatumPlane)
PropagateToViews |  Propagates the extents applied to this datum in the view to the specified parallel views.
(Inherited from DatumPlane)
RefersToExternalResourceReference |  Determines whether this Element uses external resources associated with a specified external resource type.
(Inherited from Element)
RefersToExternalResourceReferences |  Determines whether this Element uses external resources.
(Inherited from Element)
SetCurveInView |  Sets the extents to match the curve.
(Inherited from DatumPlane)
SetDatumExtentType |  Sets whether the curve representing the datum plane is displayed according to its 3d extents, or else according to a view specific setting.
(Inherited from DatumPlane)
SetEntity |  Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
(Inherited from Element)
SetLeader |  Sets the leader to the indicated end of the datum plane. This method does not apply to Reference planes (which do not support leaders).
(Inherited from DatumPlane)
SetVerticalExtents |  Adjusts the grid to extend through only the vertical range between bottom and top.
ShowBubbleInView |  Shows the bubble in a view. This method does not apply to Reference planes.
(Inherited from DatumPlane)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 A Grid is a DatumPlane, so it is actually a three dimensional surface. It can be either a plane parallel to the project z-axis, or else a cylinder whose axis is parallel to the project z-xis. [!:Autodesk::Revit::DatumPlane]
Example
public void GetInfo_Grid(Grid grid)
{
    string message = "Grid : ";
    // Show IsCurved property
    message += "\nIf grid is Arc : " + grid.IsCurved;
    // Show Curve information
    Autodesk.Revit.DB.Curve curve = grid.Curve;
    if (grid.IsCurved)
    {
        // if the curve is an arc, give center and radius information
        Autodesk.Revit.DB.Arc arc = curve as Autodesk.Revit.DB.Arc;
        message += "\nArc's radius: " + arc.Radius;
        message += "\nArc's center:  (" + XYZToString(arc.Center);
    }
    else
    {
        // if the curve is a line, give length information
        Autodesk.Revit.DB.Line line = curve as Autodesk.Revit.DB.Line;
        message += "\nLine's Length: " + line.Length;
    }
    // Get curve start point
    message += "\nStart point: " + XYZToString(curve.GetEndPoint(0));
    // Get curve end point
    message += "; End point: " + XYZToString(curve.GetEndPoint(0));
    TaskDialog.Show("Revit",message);
}
// output the point's three coordinates
string XYZToString(XYZ point)
{
    return "(" + point.X + ", " + point.Y + ", " + point.Z + ")";
}
See Also
Reference
Autodesk.Revit.DB Namespace